<?php

use Illuminate\Database\Seeder;

/**
 * Class CreateRoles
 * This class will be seeding data to roles table.
 */
class CreateRoles extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('roles')->insert(
            [
                [
                    'id'          => '1',
                    'name'        => 'guest',
                    'description' => 'Роль назначаемая пользователям группы guest. Эта роль не имеет привилегий',
                ],

                [
                    'id'          => '2',
                    'name'        => 'regular',
                    'description' => 'Роль назначаемая пользователям для разрешения чтения всей
                                      записи, разрещённой для группы в которую он входит',
                ],

                [
                    'id'          => '3',
                    'name'        => 'moderator',
                    'description' => 'Роль назначаемая пользователям, которые проверяют созданные записи на 
                                      правильность заполнения. После проверки, люди с этой ролью разрешают 
                                      отображать запись для пользователей с ролью regular. Также пользователи 
                                      с этой ролью могут редактировать любую запись. Эта роль обычно назначается
                                      должностным лицам строевой части.',
                ],

                [
                    'id'          => '4',
                    'name'        => 'writer',
                    'description' => 'Роль назначаемая пользователям которые могут создавать записи в БД.
                                      Эта роль не имеет привилегий просмотра документов. Если пользователю
                                      необходимо просматривать документы, он должен иметь роль regular',
                ],

                [
                    'id'          => '100',
                    'name'        => 'admin',
                    'description' => 'Роль назначаемая пользователям администраторам БД.
                                      Основное прдназначение роли - предоставить права по 
                                      добавлению новых пользователей БД.',
                ],
            ]
        );
    }
}
