<?php

use Illuminate\Database\Seeder;

class CreatePrivileges extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('privileges')->insert(
            [
                /*[
                    'id'          => '0',
                    'name'        => 'reader_mi',
                    'description' => 'Роль предоставляет возможность чтения служебной информации всех записей
                                      независимо от принадлежности пользователя к какой либо группе т.е. эта
                                      возможность заложена сразуже в группе',
                ],*/

                [
                    'id'          => '1',
                    'name'        => 'reader_doc',
                    'role_id'     => '2',
                    'description' => 'Привелегия предоставляет возможность чтения всей записи из списка разрещённых.
                                      Разрещения определяются принадлежностью к группе. Наименование группы
                                      совпадает с наименованием Представления (view) базы данных посредством которого
                                      отображается информация пользователю',
                ],

                [
                    'id'          => '2',
                    'name'        => 'creator',
                    'role_id'     => '4',
                    'description' => 'Привелегия предназначена для создания записи в базе данных. Пользователь с
                                      данной привилегией не может просматривать никакой информации других записей',
                ],

                [
                    'id'          => '3',
                    'name'        => 'redactor',
                    'role_id'     => '3',
                    'description' => 'Привелегия предназначена для редактирования записей в базе данных. Пользователь с
                                      данной привилегией может просматривать все без исключения записи',
                ],

                [
                    'id'          => '4',
                    'name'        => 'dropping',
                    'role_id'     => '3',
                    'description' => 'Привелегия предназначена для мягкого удаления записей в базе данных. 
                                      Пользователь с данной привилегией может просматривать все без исключения записи.
                                      Мягкое удаление предполагает удаление записи из обработки приложением. Из базы 
                                      данных запись не удаляется',
                ],

                [
                    'id'          => '5',
                    'name'        => 'creator_user',
                    'role_id'     => '100',
                    'description' => 'Привелегия предназначена для создания новой учётной записи пользователя',
                ],

                [
                    'id'          => '6',
                    'name'        => 'redactor_user',
                    'role_id'     => '100',
                    'description' => 'Привелегия предназначена для редактирования учётной записи пользователя',
                ],

                [
                    'id'          => '7',
                    'name'        => 'reader_user',
                    'role_id'     => '100',
                    'description' => 'Привелегия предназначена для просмотра учётной записи пользователя',
                ],

                [
                    'id'          => '8',
                    'name'        => 'dropped_user',
                    'role_id'     => '100',
                    'description' => 'Привилегия предназначена для мягкого удаления учётной записи пользователя',
                ],
            ]
        );
    }
}
